# Data analysis using Pandas Library

In [100]:
import numpy as np
import pandas as pd

In [101]:
dict1 = {
    "name":['Milan','Kishan','Rajan','Kishor','Manoj'],
    "marks":[56,43,32,34,75],
    "city":['surat','mumbai','chennai','kolkata','ahmedabad']
}

In [102]:
df = pd.DataFrame(dict1)

In [103]:
df

     name  marks       city
0   Milan     56      surat
1  Kishan     43     mumbai
2   Rajan     32    chennai
3  Kishor     34    kolkata
4   Manoj     75  ahmedabad

In [104]:
df.to_csv('friends.csv')

In [105]:
df.to_csv('friends_index_false.csv', index=False)

In [106]:
df.head(2)

     name  marks    city
0   Milan     56   surat
1  Kishan     43  mumbai

In [107]:
df.tail(2)

     name  marks       city
3  Kishor     34    kolkata
4   Manoj     75  ahmedabad

In [108]:
df.describe()

          marks
count   5.00000
mean   48.00000
std    17.81853
min    32.00000
25%    34.00000
50%    43.00000
75%    56.00000
max    75.00000

In [109]:
train = pd.read_csv('train_data.csv', sep=';')

In [110]:
train

   Train no  Speed    City
0      1234     32   Surat
1      4678     98  mumbai
2      8648     66   delhi
3      8747     34    pune

In [111]:
train['Speed']

0    32
1    98
2    66
3    34
Name: Speed, dtype: int64

In [112]:
train['Speed'][0]

32

In [113]:
train['Speed'][0] = 50

<ipython-input-113-d88a1bbb3d16>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][0] = 50

In [114]:
train['Speed']

0    50
1    98
2    66
3    34
Name: Speed, dtype: int64

In [115]:
train.to_csv('train.csv')

In [116]:
train.index = ['first','second','third','fourth']

In [117]:
train

        Train no  Speed    City
first       1234     50   Surat
second      4678     98  mumbai
third       8648     66   delhi
fourth      8747     34    pune

In [118]:
ser = pd.Series(np.random.rand(34))

In [119]:
ser

0     0.439251
1     0.624742
2     0.530543
3     0.931587
4     0.033500
5     0.914883
6     0.672531
7     0.294258
8     0.885581
9     0.924691
10    0.006000
11    0.871991
12    0.004166
13    0.512261
14    0.054321
15    0.769532
16    0.921019
17    0.319996
18    0.383607
19    0.842642
20    0.508050
21    0.047957
22    0.766346
23    0.092617
24    0.473994
25    0.332260
26    0.577900
27    0.426746
28    0.788922
29    0.680888
30    0.727974
31    0.067841
32    0.715246
33    0.982812
dtype: float64

In [120]:
type(ser)

pandas.core.series.Series

In [121]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [122]:
newdf.head()

          0         1         2         3         4
0  0.945149  0.895381  0.590161  0.444215  0.733486
1  0.597141  0.875027  0.722555  0.114989  0.467135
2  0.498130  0.358888  0.845655  0.324135  0.377856
3  0.451588  0.986937  0.823221  0.911504  0.907150
4  0.376308  0.288456  0.654783  0.087492  0.788722

In [123]:
type(newdf)

pandas.core.frame.DataFrame

In [124]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.512211    0.495064    0.506178    0.509813    0.507620
std      0.292608    0.296067    0.282029    0.285287    0.287727
min      0.000683    0.005214    0.012004    0.005490    0.000705
25%      0.284165    0.236638    0.267950    0.252161    0.252790
50%      0.499798    0.496873    0.510917    0.522521    0.496026
75%      0.780828    0.756015    0.737719    0.752963    0.747470
max      0.997593    0.999683    0.998514    0.997650    0.995950

In [125]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [126]:
newdf[0][0] = 0.4343343

In [127]:
newdf.head()

          0         1         2         3         4
0  0.434334  0.895381  0.590161  0.444215  0.733486
1  0.597141  0.875027  0.722555  0.114989  0.467135
2  0.498130  0.358888  0.845655  0.324135  0.377856
3  0.451588  0.986937  0.823221  0.911504  0.907150
4  0.376308  0.288456  0.654783  0.087492  0.788722

In [128]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [129]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [130]:
newdf.to_numpy()

array([[0.4343343 , 0.89538125, 0.59016112, 0.44421474, 0.73348625],
       [0.59714071, 0.87502748, 0.72255535, 0.11498906, 0.46713453],
       [0.49813014, 0.35888816, 0.84565543, 0.32413511, 0.37785587],
       ...,
       [0.17536303, 0.4285388 , 0.64181285, 0.81317883, 0.62429901],
       [0.58127516, 0.12733618, 0.76121627, 0.77008071, 0.57703736],
       [0.5867305 , 0.75308612, 0.08165138, 0.16106883, 0.7346531 ]])

In [131]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.434334,0.597141,0.498130,0.451588,0.376308,0.248465,0.268893,0.198803,0.045005,0.644786,...,0.082981,0.738370,0.217532,0.332742,0.779214,0.788316,0.551248,0.175363,0.581275,0.586730
1,0.895381,0.875027,0.358888,0.986937,0.288456,0.805112,0.738831,0.918071,0.198902,0.193431,...,0.960169,0.032746,0.629446,0.651549,0.886182,0.905615,0.336574,0.428539,0.127336,0.753086
2,0.590161,0.722555,0.845655,0.823221,0.654783,0.778345,0.940524,0.143893,0.392425,0.274372,...,0.401948,0.020419,0.090397,0.697491,0.955817,0.359734,0.035503,0.641813,0.761216,0.081651
3,0.444215,0.114989,0.324135,0.911504,0.087492,0.094164,0.020010,0.892892,0.625935,0.746593,...,0.219476,0.946269,0.191228,0.062991,0.122029,0.406303,0.839437,0.813179,0.770081,0.161069
4,0.733486,0.467135,0.377856,0.907150,0.788722,0.898176,0.861730,0.367800,0.913322,0.806969,...,0.894085,0.854904,0.583546,0.535310,0.373025,0.489160,0.552471,0.624299,0.577037,0.734653

In [132]:
newdf.head()

          0         1         2         3         4
0  0.434334  0.895381  0.590161  0.444215  0.733486
1  0.597141  0.875027  0.722555  0.114989  0.467135
2  0.498130  0.358888  0.845655  0.324135  0.377856
3  0.451588  0.986937  0.823221  0.911504  0.907150
4  0.376308  0.288456  0.654783  0.087492  0.788722

In [133]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.733486  0.444215  0.590161  0.895381  0.434334
1    0.467135  0.114989  0.722555  0.875027  0.597141
2    0.377856  0.324135  0.845655  0.358888  0.498130
3    0.907150  0.911504  0.823221  0.986937  0.451588
4    0.788722  0.087492  0.654783  0.288456  0.376308
..        ...       ...       ...       ...       ...
329  0.489160  0.406303  0.359734  0.905615  0.788316
330  0.552471  0.839437  0.035503  0.336574  0.551248
331  0.624299  0.813179  0.641813  0.428539  0.175363
332  0.577037  0.770081  0.761216  0.127336  0.581275
333  0.734653  0.161069  0.081651  0.753086  0.586730

[334 rows x 5 columns]

In [134]:
type(newdf[0])

pandas.core.series.Series

In [135]:
newdf2 = newdf.copy

In [136]:
newdf2[0][0] = 0.232323232

TypeError: 'method' object is not subscriptable

In [137]:
newdf

            0         1         2         3         4
0    0.434334  0.895381  0.590161  0.444215  0.733486
1    0.597141  0.875027  0.722555  0.114989  0.467135
2    0.498130  0.358888  0.845655  0.324135  0.377856
3    0.451588  0.986937  0.823221  0.911504  0.907150
4    0.376308  0.288456  0.654783  0.087492  0.788722
..        ...       ...       ...       ...       ...
329  0.788316  0.905615  0.359734  0.406303  0.489160
330  0.551248  0.336574  0.035503  0.839437  0.552471
331  0.175363  0.428539  0.641813  0.813179  0.624299
332  0.581275  0.127336  0.761216  0.770081  0.577037
333  0.586730  0.753086  0.081651  0.161069  0.734653

[334 rows x 5 columns]

In [138]:
newdf.loc[0,0] = 353

In [139]:
newdf.head(2)

            0         1         2         3         4
0  353.000000  0.895381  0.590161  0.444215  0.733486
1    0.597141  0.875027  0.722555  0.114989  0.467135

In [140]:
newdf.columns = list("ABCDE")

In [141]:
newdf.head(2)

            A         B         C         D         E
0  353.000000  0.895381  0.590161  0.444215  0.733486
1    0.597141  0.875027  0.722555  0.114989  0.467135

In [142]:
newdf.loc[0,'A'] = 353

In [143]:
newdf.head(2)

            A         B         C         D         E
0  353.000000  0.895381  0.590161  0.444215  0.733486
1    0.597141  0.875027  0.722555  0.114989  0.467135

In [144]:
newdf = newdf.drop(0,axis=1)

KeyError: '[0] not found in axis'

In [145]:
newdf.head()

            A         B         C         D         E
0  353.000000  0.895381  0.590161  0.444215  0.733486
1    0.597141  0.875027  0.722555  0.114989  0.467135
2    0.498130  0.358888  0.845655  0.324135  0.377856
3    0.451588  0.986937  0.823221  0.911504  0.907150
4    0.376308  0.288456  0.654783  0.087492  0.788722

In [146]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.722555  0.114989
2  0.845655  0.324135

In [147]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
5    0.248465  0.805112  0.778345  0.094164  0.898176
6    0.268893  0.738831  0.940524  0.020010  0.861730
7    0.198803  0.918071  0.143893  0.892892  0.367800
8    0.045005  0.198902  0.392425  0.625935  0.913322
22   0.256610  0.112010  0.525053  0.093391  0.103850
..        ...       ...       ...       ...       ...
312  0.220335  0.916169  0.393327  0.789535  0.887321
314  0.172483  0.433633  0.295799  0.751998  0.739040
323  0.226297  0.155100  0.192922  0.453518  0.304673
324  0.082981  0.960169  0.401948  0.219476  0.894085
331  0.175363  0.428539  0.641813  0.813179  0.624299

[88 rows x 5 columns]

In [148]:
newdf.head(2)

            A         B         C         D         E
0  353.000000  0.895381  0.590161  0.444215  0.733486
1    0.597141  0.875027  0.722555  0.114989  0.467135

In [149]:
newdf.iloc[0,4]

0.7334862465527154

In [150]:
newdf.reset_index(drop=True, inplace=True)

In [151]:
newdf.head()

            A         B         C         D         E
0  353.000000  0.895381  0.590161  0.444215  0.733486
1    0.597141  0.875027  0.722555  0.114989  0.467135
2    0.498130  0.358888  0.845655  0.324135  0.377856
3    0.451588  0.986937  0.823221  0.911504  0.907150
4    0.376308  0.288456  0.654783  0.087492  0.788722

In [152]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: B, Length: 334, dtype: bool

In [153]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [154]:
df.head()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [155]:
df.dropna(how='all', axis=1)

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [156]:
df.drop_duplicates(subset=['name'])

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [157]:
df.shape

(3, 3)

In [158]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [159]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [160]:
spedf = pd.DataFrame({"Name": ['JKM', 'JPD', 'JVD','JHD'],
                   "Temple": ['Galdhara', 'Dolti', 'Virpur','Kerala']
                  })

In [161]:
spedf

  Name    Temple
0  JKM  Galdhara
1  JPD     Dolti
2  JVD    Virpur
3  JHD    Kerala

In [162]:
df.describe()

<ipython-input-162-ea8415b8a3ee>:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df.describe()

          name        toy                 born
count        3          2                    1
unique       2          2                    1
top     Alfred  Batmobile  1940-04-25 00:00:00
freq         2          1                    1
first      NaN        NaN  1940-04-25 00:00:00
last       NaN        NaN  1940-04-25 00:00:00

In [163]:
df.mean()

<ipython-input-163-c61f0c8f89b5>:1: FutureWarning: DataFrame.mean and DataFrame.median with numeric_only=None will include datetime64 and datetime64tz columns in a future version.
  df.mean()

Series([], dtype: float64)

In [164]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [165]:
df.shape

(3, 3)

In [166]:
df.info

<bound method DataFrame.info of      name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT>